zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal_eth.h
/** @defgroup ETH_Rx_L4_Filter_Status ETH Rx L4 Filter Status
  * @{
  */
#define ETH_L4_FILTER0_MATCH        ETH_DMARXNDESCWBF_L4FM
#define ETH_L4_FILTER1_MATCH        (ETH_DMARXNDESCWBF_L4FM | ETH_DMARXNDESCWBF_L3L4FM)
/**
  * @}
  */

/** @defgroup ETH_Rx_Error_Code ETH Rx Error Code
  * @{
  */
#define ETH_DRIBBLE_BIT_ERROR   ETH_DMARXNDESCWBF_DE
#define ETH_RECEIVE_ERROR       ETH_DMARXNDESCWBF_RE
#define ETH_RECEIVE_OVERFLOW    ETH_DMARXNDESCWBF_OE
#define ETH_WATCHDOG_TIMEOUT    ETH_DMARXNDESCWBF_RWT
#define ETH_GIANT_PACKET        ETH_DMARXNDESCWBF_GP
#define ETH_CRC_ERROR           ETH_DMARXNDESCWBF_CE
/**
  * @}
  */

/** @defgroup ETH_DMA_Arbitration ETH DMA Arbitration
  * @{
  */
#define ETH_DMAARBITRATION_TX_FIXED_PRIORITY         (0x00000000U)
#define ETH_DMAARBITRATION_TX_STRICT_PRIORITY        (ETH_DMAMR_TAA_0)
#define ETH_DMAARBITRATION_TX_ROUNDROBIN_PRIORITY    (ETH_DMAMR_TAA_1)
#define ETH_DMAARBITRATION_TX        (ETH_DMAARBITRATION_TX_FIXED_PRIORITY)
/**
  * @}
  */

/** @defgroup ETH_Burst_Mode ETH Burst Mode
  * @{
  */
#define ETH_BURSTLENGTH_FIXED           ETH_DMASBMR_FB
#define ETH_BURSTLENGTH_UNSPECIFIED     0x00000000U
/**
  * @}
  */

/** @defgroup ETH_BLEN_Size ETH Blen size
  * @{
  */
#define ETH_BLEN_MAX_SIZE_256             (ETH_DMASBMR_BLEN256 | ETH_BLEN_MAX_SIZE_128)
#define ETH_BLEN_MAX_SIZE_128             (ETH_DMASBMR_BLEN128 | ETH_BLEN_MAX_SIZE_64)
#define ETH_BLEN_MAX_SIZE_64              (ETH_DMASBMR_BLEN64 | ETH_BLEN_MAX_SIZE_32)
#define ETH_BLEN_MAX_SIZE_32              (ETH_DMASBMR_BLEN32 | ETH_BLEN_MAX_SIZE_16)
#define ETH_BLEN_MAX_SIZE_16              (ETH_DMASBMR_BLEN16 | ETH_BLEN_MAX_SIZE_8)
#define ETH_BLEN_MAX_SIZE_8               (ETH_DMASBMR_BLEN8 | ETH_BLEN_MAX_SIZE_4)
#define ETH_BLEN_MAX_SIZE_4               ETH_DMASBMR_BLEN4

/**
  * @}
  */

/** @defgroup ETH_RX_OSR_LIMIT ETH Rx maximum read outstanding request limit
  * @{
  */
#define ETH_RX_OSR_LIMIT_1 ETH_DMASBMR_RD_OSR_LMT_0
#define ETH_RX_OSR_LIMIT_2 ETH_DMASBMR_RD_OSR_LMT_1
#define ETH_RX_OSR_LIMIT_3 (ETH_DMASBMR_RD_OSR_LMT_1 | ETH_DMASBMR_RD_OSR_LMT_0)

/**
  * @}
  */

/** @defgroup ETH_TX_OSR_LIMIT ETH Tx maximum write outstanding request limit
  * @{
  */
#define ETH_TX_OSR_LIMIT_1 ETH_DMASBMR_WR_OSR_LMT_0
#define ETH_TX_OSR_LIMIT_2 ETH_DMASBMR_WR_OSR_LMT_1
#define ETH_TX_OSR_LIMIT_3 (ETH_DMASBMR_WR_OSR_LMT_1 | ETH_DMASBMR_WR_OSR_LMT_0)
/**
  * @}
  */

/** @defgroup ETH_Tx_DMA_Burst_Length ETH Tx DMA Burst Length
  * @{
  */
#define ETH_TXDMABURSTLENGTH_1BEAT          ETH_DMAC0TXCR_TXPBL_1PBL
#define ETH_TXDMABURSTLENGTH_2BEAT          ETH_DMAC0TXCR_TXPBL_2PBL
#define ETH_TXDMABURSTLENGTH_4BEAT          ETH_DMAC0TXCR_TXPBL_4PBL
#define ETH_TXDMABURSTLENGTH_8BEAT          ETH_DMAC0TXCR_TXPBL_8PBL
#define ETH_TXDMABURSTLENGTH_16BEAT         ETH_DMAC0TXCR_TXPBL_16PBL
#define ETH_TXDMABURSTLENGTH_32BEAT         ETH_DMAC0TXCR_TXPBL_32PBL
/**
  * @}
  */

/** @defgroup ETH_Rx_DMA_Burst_Length ETH Rx DMA Burst Length
  * @{
  */
#define ETH_RXDMABURSTLENGTH_1BEAT          ETH_DMAC0RXCR_RXPBL_1PBL
#define ETH_RXDMABURSTLENGTH_2BEAT          ETH_DMAC0RXCR_RXPBL_2PBL
#define ETH_RXDMABURSTLENGTH_4BEAT          ETH_DMAC0RXCR_RXPBL_4PBL
#define ETH_RXDMABURSTLENGTH_8BEAT          ETH_DMAC0RXCR_RXPBL_8PBL
#define ETH_RXDMABURSTLENGTH_16BEAT         ETH_DMAC0RXCR_RXPBL_16PBL
#define ETH_RXDMABURSTLENGTH_32BEAT         ETH_DMAC0RXCR_RXPBL_32PBL
/**
  * @}
  */

/** @defgroup ETH_DMA_Interrupts ETH DMA Interrupts
  * @{
  */
#define ETH_DMA_NORMAL_IT                 ETH_DMACIER_NIE
#define ETH_DMA_ABNORMAL_IT               ETH_DMACIER_AIE
#define ETH_DMA_CONTEXT_DESC_ERROR_IT     ETH_DMACIER_CDEE
#define ETH_DMA_FATAL_BUS_ERROR_IT        ETH_DMACIER_FBEE
#define ETH_DMA_EARLY_RX_IT               ETH_DMACIER_ERIE
#define ETH_DMA_EARLY_TX_IT               ETH_DMACIER_ETIE
#define ETH_DMA_RX_WATCHDOG_TIMEOUT_IT    ETH_DMACIER_RWTE
#define ETH_DMA_RX_PROCESS_STOPPED_IT     ETH_DMACIER_RSE
#define ETH_DMA_RX_BUFFER_UNAVAILABLE_IT  ETH_DMACIER_RBUE
#define ETH_DMA_RX_IT                     ETH_DMACIER_RIE
#define ETH_DMA_TX_BUFFER_UNAVAILABLE_IT  ETH_DMACIER_TBUE
#define ETH_DMA_TX_PROCESS_STOPPED_IT     ETH_DMACIER_TXSE
#define ETH_DMA_TX_IT                     ETH_DMACIER_TIE
/**
  * @}
  */

/** @defgroup ETH_DMA_Status_Flags ETH DMA Status Flags
  * @{
  */
#define ETH_DMA_RX_NO_ERROR_FLAG                 0x00000000U
#define ETH_DMA_RX_DESC_READ_ERROR_FLAG          0x00380000U
#define ETH_DMA_RX_DESC_WRITE_ERROR_FLAG         0x00300000U
#define ETH_DMA_RX_BUFFER_READ_ERROR_FLAG        0x00280000U
#define ETH_DMA_RX_BUFFER_WRITE_ERROR_FLAG       0x00200000U
#define ETH_DMA_TX_NO_ERROR_FLAG                 0x00000000U
#define ETH_DMA_TX_DESC_READ_ERROR_FLAG          0x00070000U
#define ETH_DMA_TX_DESC_WRITE_ERROR_FLAG         0x00060000U
#define ETH_DMA_TX_BUFFER_READ_ERROR_FLAG        0x00050000U
#define ETH_DMA_TX_BUFFER_WRITE_ERROR_FLAG       0x00040000U
#define ETH_DMA_CONTEXT_DESC_ERROR_FLAG          ETH_DMAC0SR_CDE
#define ETH_DMA_FATAL_BUS_ERROR_FLAG             ETH_DMAC0SR_FBE
#define ETH_DMA_EARLY_TX_IT_FLAG                 ETH_DMAC0SR_ERI
#define ETH_DMA_RX_WATCHDOG_TIMEOUT_FLAG         ETH_DMAC0SR_RWT
#define ETH_DMA_RX_PROCESS_STOPPED_FLAG          ETH_DMAC0SR_RPS
#define ETH_DMA_RX_BUFFER_UNAVAILABLE_FLAG       ETH_DMAC0SR_RBU
#define ETH_DMA_TX_PROCESS_STOPPED_FLAG          ETH_DMAC0SR_TPS
/**
  * @}
  */

/** @defgroup ETH_Transmit_Mode ETH Transmit Mode
  * @{
  */
#define ETH_TRANSMITQUEUE_ENABLE_AV    ETH_MTLTXQ0OMR_TXQEN_0
#define ETH_TRANSMITQUEUE_ENABLE_ALL   ETH_MTLTXQ0OMR_TXQEN_1

#define ETH_TRANSMITSTOREFORWARD       ETH_MTLTXQ0OMR_TSF
#define ETH_TRANSMITTHRESHOLD_32       ETH_MTLTXQ0OMR_TTC_32BITS
#define ETH_TRANSMITTHRESHOLD_64       ETH_MTLTXQ0OMR_TTC_64BITS
#define ETH_TRANSMITTHRESHOLD_96       ETH_MTLTXQ0OMR_TTC_96BITS
#define ETH_TRANSMITTHRESHOLD_128      ETH_MTLTXQ0OMR_TTC_128BITS
#define ETH_TRANSMITTHRESHOLD_192      ETH_MTLTXQ0OMR_TTC_192BITS
#define ETH_TRANSMITTHRESHOLD_256      ETH_MTLTXQ0OMR_TTC_256BITS
#define ETH_TRANSMITTHRESHOLD_384      ETH_MTLTXQ0OMR_TTC_384BITS
#define ETH_TRANSMITTHRESHOLD_512      ETH_MTLTXQ0OMR_TTC_512BITS
/**
  * @}
  */

/** @defgroup ETH_Receive_Mode ETH Receive Mode
  * @{
  */
#define ETH_RECEIVEQUEUE_ENABLE_AV     ETH_MACRXQC0R_RXQ0EN_0
#define ETH_RECEIVEQUEUE_ENABLE_ALL    ETH_MACRXQC0R_RXQ0EN_1

#define ETH_RECEIVESTOREFORWARD        ETH_MTLRXQ0OMR_RSF
#define ETH_RECEIVETHRESHOLD8_64       ETH_MTLRXQ0OMR_RTC_64BITS
#define ETH_RECEIVETHRESHOLD8_32       ETH_MTLRXQ0OMR_RTC_32BITS
#define ETH_RECEIVETHRESHOLD8_96       ETH_MTLRXQ0OMR_RTC_96BITS
#define ETH_RECEIVETHRESHOLD8_128      ETH_MTLRXQ0OMR_RTC_128BITS
/**
  * @}
  */

